{
    "0": {
        "year": 2017,
        "name": "Justice League",
        "plot": "\nFueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his newfound ally, Diana Prince, to face an even greater enemy."
    },
    "1": {
        "year": 2017,
        "name": "The Punisher",
        "plot": "\nAfter the murder of his family, Marine veteran Frank Castle became a vigilante known as \"The Punisher\" with only one goal in mind, to avenge them."
    },
    "2": {
        "year": 2017,
        "name": "Godless",
        "plot": "\nFrank Griffin, an outlaw terrorizing the 1880s American West, hunts down Roy Goode, his partner turned enemy. Roy hides out at a ranch as Frank's chase leads him to La Belle, New Mexico - a town mysteriously made up almost entirely of women."
    },
    "3": {
        "year": 2017,
        "name": "Coco",
        "plot": "\nAspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer."
    },
    "4": {
        "year": 2017,
        "name": "Thor: Ragnarok",
        "plot": "\nImprisoned, the almighty Thor finds himself in a lethal gladiatorial contest against the Hulk, his former ally. Thor must fight for survival and race against time to prevent the all-powerful Hela from destroying his home and the Asgardian civilization."
    },
    "5": {
        "year": 2017,
        "name": "Star Wars: The Last Jedi",
        "plot": "\nHaving taken her first steps into the Jedi world, Rey joins Luke Skywalker on an adventure with Leia, Finn and Poe that unlocks mysteries of the Force and secrets of the past."
    },
    "6": {
        "year": 2017,
        "name": "Murder on the Orient Express",
        "plot": "\nWhen a murder occurs on the train he's travelling on, celebrated detective Hercule Poirot is recruited to solve the case."
    },
    "7": {
        "year": 2017,
        "name": "Lady Bird",
        "plot": "\nIn the early 2000s, an artistically-inclined seventeen year-old comes of age in Sacramento, California."
    },
    "8": {
        "year": 2017,
        "name": "Kingsman: The Golden Circle",
        "plot": "\nWhen their headquarters are destroyed and the world is held hostage, the Kingsman's journey leads them to the discovery of an allied spy organization in the US. These two elite secret organizations must band together to defeat a common enemy."
    },
    "9": {
        "year": 2017,
        "name": "Wonder",
        "plot": "\nBased on the New York Times bestseller, WONDER tells the incredibly inspiring and heartwarming story of August Pullman, a boy with facial differences who enters fifth grade, attending a mainstream elementary school for the first time."
    },
    "10": {
        "year": 2017,
        "name": "The Disaster Artist",
        "plot": "\nWhen Greg Sestero, an aspiring film actor, meets the weird and mysterious Tommy Wiseau in an acting class, they form a unique friendship and travel to Hollywood to make their dreams come true."
    },
    "11": {
        "year": 2017,
        "name": "Runaways",
        "plot": "\nAfter discovering their parents are super-villains in disguise, a group of teenagers band together to run away from their homes in order to atone for their parents' actions and to discover the secrets of their origins."
    },
    "12": {
        "year": 2017,
        "name": "The Good Doctor",
        "plot": "\nShaun Murphy, a young surgeon with autism and Savant syndrome, is recruited into the surgical unit of a prestigious hospital."
    },
    "13": {
        "year": 2017,
        "name": "Daddy's Home 2",
        "plot": "\nHaving finally gotten used to each other's existence, Brad and Dusty must now deal with their intrusive fathers during the holidays."
    },
    "14": {
        "year": 2017,
        "name": "The Orville",
        "plot": "\nFollows the crew of the not-so-functional exploratory ship in the Earth's interstellar fleet, 400 years in the future."
    },
    "15": {
        "year": 2017,
        "name": "Mindhunter",
        "plot": "\nIn the late 1970s two FBI agents expand criminal science by delving into the psychology of murder and getting uneasily close to all-too-real monsters."
    },
    "16": {
        "year": 2017,
        "name": "American Assassin",
        "plot": "\nAfter the death of his girlfriend at the hands of terrorists, Mitch Rapp is drawn into the world of counterterrorism, mentored by tough-as-nails former U.S. Navy S.E.A.L. Stan Hurley."
    },
    "17": {
        "year": 2017,
        "name": "Valerian and the City of a Thousand Planets",
        "plot": "\nA dark force threatens Alpha, a vast metropolis and home to species from a thousand planets. Special operatives Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe."
    },
    "18": {
        "year": 2017,
        "name": "Future Man",
        "plot": "\nJosh Futturman, a janitor by day and a gamer by night, is recruited by mysterious visitors to travel through time to prevent the extinction of humanity."
    },
    "19": {
        "year": 2017,
        "name": "Call Me by Your Name",
        "plot": "\nIn Northern Italy in 1983, seventeen year-old Elio begins a relationship with visiting Oliver, his father's research assistant, with whom he bonds over his emerging sexuality, their Jewish heritage, and the beguiling Italian landscape."
    },
    "20": {
        "year": 2017,
        "name": "Three Billboards Outside Ebbing, Missouri",
        "plot": "\nA mother personally challenges the local authorities to solve her daughter's murder when they fail to catch the culprit."
    },
    "21": {
        "year": 2017,
        "name": "The Shape of Water",
        "plot": "\nAn other-worldly fairy tale, set against the backdrop of Cold War era America circa 1962. In the hidden high-security government laboratory where she works, lonely Elisa (Sally Hawkins) is trapped in a life of isolation. Elisa's life is changed forever when she and co-worker Zelda (Octavia Spencer) discover a secret classified experiment."
    },
    "22": {
        "year": 2017,
        "name": "It",
        "plot": "\nA group of bullied kids band together when a shapeshifting monster, taking the appearance of a clown, begins hunting children."
    },
    "23": {
        "year": 2017,
        "name": "Jumanji: Welcome to the Jungle",
        "plot": "\nFour teenagers discover an old video game console and are literally drawn into the game's jungle setting becoming the adult avatars they chose."
    },
    "24": {
        "year": 2017,
        "name": "Geostorm",
        "plot": "\nWhen the network of satellites designed to control the global climate starts to attack Earth, it's a race against the clock for its creator to uncover the real threat before a worldwide Geostorm wipes out everything and everyone."
    },
    "25": {
        "year": 2017,
        "name": "Logan Lucky",
        "plot": "\nTwo brothers attempt to pull off a heist during a NASCAR race in North Carolina."
    },
    "26": {
        "year": 2017,
        "name": "The Gifted",
        "plot": "\nIn a world where mutated humans are treated with distrust and fear, an institute for mutants battles to achieve peaceful co-existence with humanity."
    },
    "27": {
        "year": 2017,
        "name": "Wonder Woman",
        "plot": "\nWhen a pilot crashes and tells of conflict in the outside world, Diana, an Amazonian warrior in training, leaves home to fight a war, discovering her full powers and true destiny."
    },
    "28": {
        "year": 2017,
        "name": "Star Trek: Discovery",
        "plot": "\nTen years before Kirk, Spock and the Enterprise, the USS Discovery discovers new worlds and lifeforms as one Starfleet officer learns to understand all things alien."
    },
    "29": {
        "year": 2017,
        "name": "The Greatest Showman",
        "plot": "\nInspired by the imagination of P.T. Barnum, The Greatest Showman is an original musical that celebrates the birth of show business and tells of a visionary who rose from nothing to create a spectacle that became a worldwide sensation."
    },
    "30": {
        "year": 2017,
        "name": "Wind River",
        "plot": "\nA veteran tracker with the Fish and Wildlife Service helps to investigate the murder of a young Native American woman, and uses the case as a means of seeking redemption for an earlier act of irresponsibility which ended in tragedy."
    },
    "31": {
        "year": 2017,
        "name": "Kong: Skull Island",
        "plot": "\nA team of scientists explore an uncharted island in the Pacific, venturing into the domain of the mighty Kong, and must fight to escape a primal Eden."
    },
    "32": {
        "year": 2017,
        "name": "Blade Runner 2049",
        "plot": "\nA young blade runner's discovery of a long-buried secret leads him to track down former blade runner Rick Deckard, who's been missing for thirty years."
    },
    "33": {
        "year": 2017,
        "name": "Spider-Man: Homecoming",
        "plot": "\nPeter Parker balances his life as an ordinary high school student in Queens with his superhero alter-ego Spider-Man, and finds himself on the trail of a new menace prowling the skies of New York City."
    },
    "34": {
        "year": 2017,
        "name": "The Sinner",
        "plot": "\nA young mother tries to find out what's causing her to have violent tendencies."
    },
    "35": {
        "year": 2017,
        "name": "The Last Post",
        "plot": "\nAden 1965. This is the story of a British army unit fighting a Yemeni insurgency in the Middle East and the women and children who were there with them."
    },
    "36": {
        "year": 2017,
        "name": "Atomic Blonde",
        "plot": "\nAn undercover MI6 agent is sent to Berlin during the Cold War to investigate the murder of a fellow agent and recover a missing list of double agents."
    },
    "37": {
        "year": 2017,
        "name": "All the Money in the World",
        "plot": "\nThe story of the kidnapping of 16-year-old John Paul Getty III and the desperate attempt by his devoted mother to convince his billionaire grandfather Jean Paul Getty to pay the ransom."
    },
    "38": {
        "year": 2017,
        "name": "Roman J. Israel, Esq.",
        "plot": "\nRoman J. Israel, Esq., a driven, idealistic defense attorney, finds himself in a tumultuous series of events that lead to a crisis and the necessity for extreme action."
    },
    "39": {
        "year": 2017,
        "name": "Detroit",
        "plot": "\nFact-based drama set during the 1967 Detroit riots in which a group of rogue police officers respond to a complaint with retribution rather than justice on their minds."
    },
    "40": {
        "year": 2017,
        "name": "Get Out",
        "plot": "\nIt's time for a young African American to meet with his white girlfriend's parents for a weekend in their secluded estate in the woods, but before long, the friendly and polite ambience will give way to a nightmare."
    },
    "41": {
        "year": 2017,
        "name": "S.W.A.T.",
        "plot": "\nFollows a locally born and bred S.W.A.T. lieutenant who is torn between loyalty to the streets and duty to his fellow officers when he's tasked to run a highly-trained unit that's the last stop for solving crimes in Los Angeles."
    },
    "42": {
        "year": 2017,
        "name": "Dark",
        "plot": "\nA family saga with a supernatural twist, set in a German town, where the disappearance of two young children exposes the relationships among four families."
    },
    "43": {
        "year": 2017,
        "name": "Hangman",
        "plot": "\nA homicide detective teams up with a criminal profiler to catch a serial killer whose crimes are inspired by the children's game Hangman."
    },
    "44": {
        "year": 2017,
        "name": "The Marvelous Mrs. Maisel",
        "plot": "\nA housewife in the early 1960s decides to become a stand-up comic."
    },
    "45": {
        "year": 2017,
        "name": "She's Gotta Have It",
        "plot": "\nThe story of one woman and her three lovers. TV series based on the film by Spike Lee."
    },
    "46": {
        "year": 2017,
        "name": "Baby Driver",
        "plot": "\nAfter being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail."
    },
    "47": {
        "year": 2017,
        "name": "Jigsaw",
        "plot": "\nBodies are turning up around the city, each having met a uniquely gruesome demise. As the investigation proceeds, evidence points to one suspect: John Kramer, the man known as Jigsaw, who has been dead for ten years."
    },
    "48": {
        "year": 2017,
        "name": "The Hitman's Bodyguard",
        "plot": "\nThe world's top bodyguard gets a new client, a hit man who must testify at the International Criminal Court. They must put their differences aside and work together to make it to the trial on time."
    },
    "49": {
        "year": 2017,
        "name": "Wonder Wheel",
        "plot": "\nOn Coney Island in the 1950s, a lifeguard tells the story of a middle-aged carousel operator and his beleaguered wife."
    },
    "50": {
        "year": 2017,
        "name": "Mudbound",
        "plot": "\nTwo men return home from World War II to work on a farm in rural Mississippi, where they struggle to deal with racism and adjusting to life after war."
    },
    "51": {
        "year": 2017,
        "name": "American Made",
        "plot": "\nThe story of Barry Seal, an American pilot who became a drug-runner for the CIA in the 1980s in a clandestine operation that would be exposed as the Iran-Contra Affair."
    },
    "52": {
        "year": 2017,
        "name": "Darkest Hour",
        "plot": "\nDuring the early days of World War II, the fate of Western Europe hangs on the newly-appointed British Prime Minister Winston Churchill, who must decide whether to negotiate with Hitler, or fight on against incredible odds."
    },
    "53": {
        "year": 2017,
        "name": "A Bad Moms Christmas",
        "plot": "\nAs their own mothers drop in unexpectedly, our three under-appreciated and over-burdened moms rebel against the challenges and expectations of the Super Bowl for mothers: Christmas."
    },
    "54": {
        "year": 2017,
        "name": "A Christmas Prince",
        "plot": "\nWhen a reporter goes undercover as a tutor to get the inside scoop on a playboy prince, she gets tangled in some royal intrigue and ends up finding love - but will she be able to keep up her lie?"
    },
    "55": {
        "year": 2017,
        "name": "I, Tonya",
        "plot": "\nCompetitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the activity is thrown into doubt when her ex-husband intervenes."
    },
    "56": {
        "year": 2017,
        "name": "The Big Sick",
        "plot": "\nPakistan-born comedian Kumail Nanjiani and grad student Emily Gardner fall in love but struggle as their cultures clash. When Emily contracts a mysterious illness, Kumail finds himself forced to face her feisty parents, his family's expectations, and his true feelings."
    },
    "57": {
        "year": 2017,
        "name": "Big Mouth",
        "plot": "\nTeenage friends find their lives upended by the wonders and horrors of puberty."
    },
    "58": {
        "year": 2017,
        "name": "Dunkirk",
        "plot": "\nAllied soldiers from Belgium, the British Empire and France are surrounded by the German Army, and evacuated during a fierce battle in World War II."
    },
    "59": {
        "year": 2017,
        "name": "The Handmaid's Tale",
        "plot": "\nSet in a dystopian future, a woman is forced to live as a concubine under a fundamentalist theocratic dictatorship."
    },
    "60": {
        "year": 2017,
        "name": "The Man Who Invented Christmas",
        "plot": "\nThe journey that led to Charles Dickens' creation of \"A Christmas Carol,\" a timeless tale that would redefine the holiday."
    },
    "61": {
        "year": 2017,
        "name": "The Star",
        "plot": "\nA small but brave donkey and his animal friends become the unsung heroes of the first Christmas."
    },
    "62": {
        "year": 2017,
        "name": "The Killing of a Sacred Deer",
        "plot": "\nSteven, a charismatic surgeon, is forced to make an unthinkable sacrifice after his life starts to fall apart, when the behavior of a teenage boy he has taken under his wing turns sinister."
    },
    "63": {
        "year": 2017,
        "name": "War for the Planet of the Apes",
        "plot": "\nAfter the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind."
    },
    "64": {
        "year": 2017,
        "name": "Guardians of the Galaxy Vol. 2",
        "plot": "\nThe Guardians must fight to keep their newfound family together as they unravel the mystery of Peter Quill's true parentage."
    },
    "65": {
        "year": 2017,
        "name": "Alias Grace",
        "plot": "\nIn 19th-century Canada, a psychiatrist weighs whether a murderess should be pardoned due to insanity."
    },
    "66": {
        "year": 2017,
        "name": "Home Again",
        "plot": "\nLife for a single mom in Los Angeles takes an unexpected turn when she allows three young guys to move in with her."
    },
    "67": {
        "year": 2017,
        "name": "13 Reasons Why",
        "plot": "\nFollows teenager Clay Jensen, in his quest to uncover the story behind his classmate and crush, Hannah, and her decision to end her life."
    },
    "68": {
        "year": 2017,
        "name": "Thoroughbreds",
        "plot": "\nTwo upper-class teenage girls in suburban Connecticut rekindle their unlikely friendship after years of growing apart. Together, they hatch a plan to solve both of their problems-no matter what the cost."
    },
    "69": {
        "year": 2017,
        "name": "SEAL Team",
        "plot": "\nThe lives of the elite Navy S.E.A.L.s as they train, plan and execute the most dangerous, high-stakes missions our country can ask."
    },
    "70": {
        "year": 2017,
        "name": "Ozark",
        "plot": "\nA Chicago-based financial advisor secretly relocates his family to the Missouri Ozarks when his dealings with a drug cartel go awry."
    },
    "71": {
        "year": 2017,
        "name": "Beauty and the Beast",
        "plot": "\nAn adaptation of the fairy tale about a monstrous-looking prince and a young woman who fall in love."
    },
    "72": {
        "year": 2017,
        "name": "The Christmas Train",
        "plot": "\nA cynical journalist decides to take a train from Washington, D.C. to Los Angeles for Christmas to get inspiration for a story in honor of his late father. He gets to know the other passengers and runs into an old flame while aboard."
    },
    "73": {
        "year": 2017,
        "name": "The Dark Tower",
        "plot": "\nThe last Gunslinger, Roland Deschain, has been locked in an eternal battle with Walter O'Dim, also known as the Man in Black, determined to prevent him from toppling the Dark Tower, which holds the universe together. With the fate of the worlds at stake, good and evil will collide in the ultimate battle as only Roland can defend the Tower from the Man in Black."
    },
    "74": {
        "year": 2017,
        "name": "Suburbicon",
        "plot": "\nA home invasion rattles a quiet family town."
    },
    "75": {
        "year": 2017,
        "name": "Phantom Thread",
        "plot": "\nSet in 1950's London, Reynolds Woodcock is a renowned dressmaker whose fastidious life is disrupted by a young, strong-willed woman, Alma, who becomes his muse and lover."
    },
    "76": {
        "year": 2017,
        "name": "The Boss Baby",
        "plot": "\nA suit-wearing, briefcase-carrying baby pairs up with his 7-year old brother to stop the dastardly plot of the CEO of Puppy Co."
    },
    "77": {
        "year": 2017,
        "name": "SMILF",
        "plot": "\nA single, 20-something mom struggles to find a happy work-life balance."
    },
    "78": {
        "year": 2017,
        "name": "The Post",
        "plot": "\nA cover-up that spanned four U.S. Presidents pushed the country's first female newspaper publisher and a hard-driving editor to join an unprecedented battle between journalist and government. Inspired by true events."
    },
    "79": {
        "year": 2017,
        "name": "Paddington 2",
        "plot": "\nPaddington, now happily settled with the Brown family and a popular member of the local community, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy's 100th birthday, only for the gift to be stolen."
    },
    "80": {
        "year": 2017,
        "name": "The Tribes of Palos Verdes",
        "plot": "\nWhen the situation at her idyllic Palos Verdes home turns volatile, young Medina attempts to surf her way to happiness."
    },
    "81": {
        "year": 2017,
        "name": "Olaf's Frozen Adventure",
        "plot": "\nA Christmas-themed special featuring characters from Walt Disney Pictures' 53rd full-length animated motion picture, \"Frozen (2013)\"."
    },
    "82": {
        "year": 2017,
        "name": "The Foreigner",
        "plot": "\nA humble businessman with a buried past seeks justice when his daughter is killed in an act of terrorism. A cat-and-mouse conflict ensues with a government official, whose past may hold clues to the killers' identities."
    },
    "83": {
        "year": 2017,
        "name": "Transformers: The Last Knight",
        "plot": "\nAutobots and Decepticons are at war, with humans on the sidelines. Optimus Prime is gone. The key to saving our future lies buried in the secrets of the past, in the hidden history of Transformers on Earth."
    },
    "84": {
        "year": 2017,
        "name": "Bullet Head",
        "plot": "\nThree career criminals find themselves trapped in a warehouse with the law closing in and an even worse threat waiting inside."
    },
    "85": {
        "year": 2017,
        "name": "Inhumans",
        "plot": "\nAn isolated community of superhumans fight to protect themselves."
    },
    "86": {
        "year": 2017,
        "name": "Downsizing",
        "plot": "\nA social satire in which a guy realizes he would have a better life if he were to shrink himself."
    },
    "87": {
        "year": 2017,
        "name": "Pitch Perfect 3",
        "plot": "\nFollowing their win at the world championship, the now separated Bellas reunite for one last singing competition at an overseas USO tour, but face a group who uses both instruments and voices."
    },
    "88": {
        "year": 2017,
        "name": "The Party",
        "plot": "\nJanet hosts a party to celebrate her new promotion, but once the guests arrive it becomes clear that not everything is going to go down as smoothly as the red wine."
    },
    "89": {
        "year": 2017,
        "name": "Cars 3",
        "plot": "\nLightning McQueen sets out to prove to a new generation of racers that he's still the best race car in the world."
    },
    "90": {
        "year": 2017,
        "name": "Jungle",
        "plot": "\nA group of friends join a guide for a trek into the Bolivian jungle, searching for an Indian village. The men soon realize that the jungle is a difficult place to be."
    },
    "91": {
        "year": 2017,
        "name": "Young Sheldon",
        "plot": "\nThe early life of child genius Sheldon Cooper, later seen in The Big Bang Theory (2007)."
    },
    "92": {
        "year": 2017,
        "name": "Happy Death Day",
        "plot": "\nA college student must relive the day of her murder over and over again, in a loop that will end only when she discovers her killer's identity."
    },
    "93": {
        "year": 2017,
        "name": "Pirates of the Caribbean: Dead Men Tell No Tales",
        "plot": "\nCaptain Jack Sparrow searches for the trident of Poseidon while being pursued by an undead sea captain and his crew."
    },
    "94": {
        "year": 2017,
        "name": "Mother!",
        "plot": "\nA couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence."
    },
    "95": {
        "year": 2017,
        "name": "The Mountain Between Us",
        "plot": "\nStranded after a tragic plane crash, two strangers must forge a connection to survive the extreme elements of a remote snow-covered mountain. When they realize help is not coming, they embark on a perilous journey across the wilderness."
    },
    "96": {
        "year": 2017,
        "name": "The Deuce",
        "plot": "\nA look at life in New York City during the 1970s and '80s when porn and prostitution were rampant in Manhattan."
    },
    "97": {
        "year": 2017,
        "name": "The Brave",
        "plot": "\nThe complex world of our bravest military heroes who make personal sacrifices while executing the most challenging and dangerous missions behind enemy lines."
    },
    "98": {
        "year": 2017,
        "name": "The Long Road Home",
        "plot": "\nAmerican forces occupying Iraq are ambushed in a Baghdad neighborhood."
    },
    "99": {
        "year": 2017,
        "name": "Crooked House",
        "plot": "\nIn Agatha Christie's most twisted tale, a spy-turned-private-detective is lured by his former lover to catch her grandfather's murderer before Scotland Yard exposes dark family secrets."
    }
}